grevaillot/svd_tools/headers/STM32H7A3x/dma2.h
#pragma once 

/* --- DMA2: DMA controller ----------------------------------------- */

/** @defgroup dma2_registers DMA controller Register
@{*/

/** DMA2_LISR low interrupt status register **/
#define DMA2_LISR			MMIO32(DMA2_BASE + 0x00)
/** DMA2_HISR high interrupt status register **/
#define DMA2_HISR			MMIO32(DMA2_BASE + 0x04)
/** DMA2_LIFCR low interrupt flag clear register **/
#define DMA2_LIFCR			MMIO32(DMA2_BASE + 0x08)
/** DMA2_HIFCR high interrupt flag clear register **/
#define DMA2_HIFCR			MMIO32(DMA2_BASE + 0x0c)
/** DMA2_S0CR stream x configuration register **/
#define DMA2_S0CR			MMIO32(DMA2_BASE + 0x10)
/** DMA2_S0NDTR stream x number of data register **/
#define DMA2_S0NDTR			MMIO32(DMA2_BASE + 0x14)
/** DMA2_S0PAR stream x peripheral address register **/
#define DMA2_S0PAR			MMIO32(DMA2_BASE + 0x18)
/** DMA2_S0M0AR stream x memory 0 address register **/
#define DMA2_S0M0AR			MMIO32(DMA2_BASE + 0x1c)
/** DMA2_S0M1AR stream x memory 1 address register **/
#define DMA2_S0M1AR			MMIO32(DMA2_BASE + 0x20)
/** DMA2_S0FCR stream x FIFO control register **/
#define DMA2_S0FCR			MMIO32(DMA2_BASE + 0x24)
/** DMA2_S1CR stream x configuration register **/
#define DMA2_S1CR			MMIO32(DMA2_BASE + 0x28)
/** DMA2_S1NDTR stream x number of data register **/
#define DMA2_S1NDTR			MMIO32(DMA2_BASE + 0x2c)
/** DMA2_S1PAR stream x peripheral address register **/
#define DMA2_S1PAR			MMIO32(DMA2_BASE + 0x30)
/** DMA2_S1M0AR stream x memory 0 address register **/
#define DMA2_S1M0AR			MMIO32(DMA2_BASE + 0x34)
/** DMA2_S1M1AR stream x memory 1 address register **/
#define DMA2_S1M1AR			MMIO32(DMA2_BASE + 0x38)
/** DMA2_S1FCR stream x FIFO control register **/
#define DMA2_S1FCR			MMIO32(DMA2_BASE + 0x3c)
/** DMA2_S2CR stream x configuration register **/
#define DMA2_S2CR			MMIO32(DMA2_BASE + 0x40)
/** DMA2_S2NDTR stream x number of data register **/
#define DMA2_S2NDTR			MMIO32(DMA2_BASE + 0x44)
/** DMA2_S2PAR stream x peripheral address register **/
#define DMA2_S2PAR			MMIO32(DMA2_BASE + 0x48)
/** DMA2_S2M0AR stream x memory 0 address register **/
#define DMA2_S2M0AR			MMIO32(DMA2_BASE + 0x4c)
/** DMA2_S2M1AR stream x memory 1 address register **/
#define DMA2_S2M1AR			MMIO32(DMA2_BASE + 0x50)
/** DMA2_S2FCR stream x FIFO control register **/
#define DMA2_S2FCR			MMIO32(DMA2_BASE + 0x54)
/** DMA2_S3CR stream x configuration register **/
#define DMA2_S3CR			MMIO32(DMA2_BASE + 0x58)
/** DMA2_S3NDTR stream x number of data register **/
#define DMA2_S3NDTR			MMIO32(DMA2_BASE + 0x5c)
/** DMA2_S3PAR stream x peripheral address register **/
#define DMA2_S3PAR			MMIO32(DMA2_BASE + 0x60)
/** DMA2_S3M0AR stream x memory 0 address register **/
#define DMA2_S3M0AR			MMIO32(DMA2_BASE + 0x64)
/** DMA2_S3M1AR stream x memory 1 address register **/
#define DMA2_S3M1AR			MMIO32(DMA2_BASE + 0x68)
/** DMA2_S3FCR stream x FIFO control register **/
#define DMA2_S3FCR			MMIO32(DMA2_BASE + 0x6c)
/** DMA2_S4CR stream x configuration register **/
#define DMA2_S4CR			MMIO32(DMA2_BASE + 0x70)
/** DMA2_S4NDTR stream x number of data register **/
#define DMA2_S4NDTR			MMIO32(DMA2_BASE + 0x74)
/** DMA2_S4PAR stream x peripheral address register **/
#define DMA2_S4PAR			MMIO32(DMA2_BASE + 0x78)
/** DMA2_S4M0AR stream x memory 0 address register **/
#define DMA2_S4M0AR			MMIO32(DMA2_BASE + 0x7c)
/** DMA2_S4M1AR stream x memory 1 address register **/
#define DMA2_S4M1AR			MMIO32(DMA2_BASE + 0x80)
/** DMA2_S4FCR stream x FIFO control register **/
#define DMA2_S4FCR			MMIO32(DMA2_BASE + 0x84)
/** DMA2_S5CR stream x configuration register **/
#define DMA2_S5CR			MMIO32(DMA2_BASE + 0x88)
/** DMA2_S5NDTR stream x number of data register **/
#define DMA2_S5NDTR			MMIO32(DMA2_BASE + 0x8c)
/** DMA2_S5PAR stream x peripheral address register **/
#define DMA2_S5PAR			MMIO32(DMA2_BASE + 0x90)
/** DMA2_S5M0AR stream x memory 0 address register **/
#define DMA2_S5M0AR			MMIO32(DMA2_BASE + 0x94)
/** DMA2_S5M1AR stream x memory 1 address register **/
#define DMA2_S5M1AR			MMIO32(DMA2_BASE + 0x98)
/** DMA2_S5FCR stream x FIFO control register **/
#define DMA2_S5FCR			MMIO32(DMA2_BASE + 0x9c)
/** DMA2_S6CR stream x configuration register **/
#define DMA2_S6CR			MMIO32(DMA2_BASE + 0xa0)
/** DMA2_S6NDTR stream x number of data register **/
#define DMA2_S6NDTR			MMIO32(DMA2_BASE + 0xa4)
/** DMA2_S6PAR stream x peripheral address register **/
#define DMA2_S6PAR			MMIO32(DMA2_BASE + 0xa8)
/** DMA2_S6M0AR stream x memory 0 address register **/
#define DMA2_S6M0AR			MMIO32(DMA2_BASE + 0xac)
/** DMA2_S6M1AR stream x memory 1 address register **/
#define DMA2_S6M1AR			MMIO32(DMA2_BASE + 0xb0)
/** DMA2_S6FCR stream x FIFO control register **/
#define DMA2_S6FCR			MMIO32(DMA2_BASE + 0xb4)
/** DMA2_S7CR stream x configuration register **/
#define DMA2_S7CR			MMIO32(DMA2_BASE + 0xb8)
/** DMA2_S7NDTR stream x number of data register **/
#define DMA2_S7NDTR			MMIO32(DMA2_BASE + 0xbc)
/** DMA2_S7PAR stream x peripheral address register **/
#define DMA2_S7PAR			MMIO32(DMA2_BASE + 0xc0)
/** DMA2_S7M0AR stream x memory 0 address register **/
#define DMA2_S7M0AR			MMIO32(DMA2_BASE + 0xc4)
/** DMA2_S7M1AR stream x memory 1 address register **/
#define DMA2_S7M1AR			MMIO32(DMA2_BASE + 0xc8)
/** DMA2_S7FCR stream x FIFO control register **/
#define DMA2_S7FCR			MMIO32(DMA2_BASE + 0xcc)

/**@}*/


/** @defgroup dma2_lisr LISR low interrupt status register
@{*/

/** DMA2_LISR_TCIF3 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LISR_TCIF3		(1 << 27)
/** DMA2_LISR_HTIF3 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA2_LISR_HTIF3		(1 << 26)
/** DMA2_LISR_TEIF3 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA2_LISR_TEIF3		(1 << 25)
/** DMA2_LISR_DMEIF3 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA2_LISR_DMEIF3		(1 << 24)
/** DMA2_LISR_FEIF3 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA2_LISR_FEIF3		(1 << 22)
/** DMA2_LISR_TCIF2 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LISR_TCIF2		(1 << 21)
/** DMA2_LISR_HTIF2 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA2_LISR_HTIF2		(1 << 20)
/** DMA2_LISR_TEIF2 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA2_LISR_TEIF2		(1 << 19)
/** DMA2_LISR_DMEIF2 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA2_LISR_DMEIF2		(1 << 18)
/** DMA2_LISR_FEIF2 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA2_LISR_FEIF2		(1 << 16)
/** DMA2_LISR_TCIF1 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LISR_TCIF1		(1 << 11)
/** DMA2_LISR_HTIF1 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA2_LISR_HTIF1		(1 << 10)
/** DMA2_LISR_TEIF1 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA2_LISR_TEIF1		(1 << 9)
/** DMA2_LISR_DMEIF1 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA2_LISR_DMEIF1		(1 << 8)
/** DMA2_LISR_FEIF1 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA2_LISR_FEIF1		(1 << 6)
/** DMA2_LISR_TCIF0 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LISR_TCIF0		(1 << 5)
/** DMA2_LISR_HTIF0 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA2_LISR_HTIF0		(1 << 4)
/** DMA2_LISR_TEIF0 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA2_LISR_TEIF0		(1 << 3)
/** DMA2_LISR_DMEIF0 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA2_LISR_DMEIF0		(1 << 2)
/** DMA2_LISR_FEIF0 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA2_LISR_FEIF0		(1 << 0)

/**@}*/

/** @defgroup dma2_hisr HISR high interrupt status register
@{*/

/** DMA2_HISR_TCIF7 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA2_HISR_TCIF7		(1 << 27)
/** DMA2_HISR_HTIF7 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA2_HISR_HTIF7		(1 << 26)
/** DMA2_HISR_TEIF7 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA2_HISR_TEIF7		(1 << 25)
/** DMA2_HISR_DMEIF7 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA2_HISR_DMEIF7		(1 << 24)
/** DMA2_HISR_FEIF7 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA2_HISR_FEIF7		(1 << 22)
/** DMA2_HISR_TCIF6 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA2_HISR_TCIF6		(1 << 21)
/** DMA2_HISR_HTIF6 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA2_HISR_HTIF6		(1 << 20)
/** DMA2_HISR_TEIF6 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA2_HISR_TEIF6		(1 << 19)
/** DMA2_HISR_DMEIF6 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA2_HISR_DMEIF6		(1 << 18)
/** DMA2_HISR_FEIF6 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA2_HISR_FEIF6		(1 << 16)
/** DMA2_HISR_TCIF5 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA2_HISR_TCIF5		(1 << 11)
/** DMA2_HISR_HTIF5 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA2_HISR_HTIF5		(1 << 10)
/** DMA2_HISR_TEIF5 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA2_HISR_TEIF5		(1 << 9)
/** DMA2_HISR_DMEIF5 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA2_HISR_DMEIF5		(1 << 8)
/** DMA2_HISR_FEIF5 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA2_HISR_FEIF5		(1 << 6)
/** DMA2_HISR_TCIF4 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA2_HISR_TCIF4		(1 << 5)
/** DMA2_HISR_HTIF4 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA2_HISR_HTIF4		(1 << 4)
/** DMA2_HISR_TEIF4 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA2_HISR_TEIF4		(1 << 3)
/** DMA2_HISR_DMEIF4 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA2_HISR_DMEIF4		(1 << 2)
/** DMA2_HISR_FEIF4 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA2_HISR_FEIF4		(1 << 0)

/**@}*/

/** @defgroup dma2_lifcr LIFCR low interrupt flag clear register
@{*/

