grevaillot/svd_tools/headers/STM32H7A3x/dma2.h
/** DMA2_S2CR_ACK ACK **/
#define DMA2_S2CR_ACK		(1 << 20)
/** DMA2_S2CR_CT Current target (only in double buffer mode) **/
#define DMA2_S2CR_CT		(1 << 19)
/** DMA2_S2CR_DBM Double buffer mode **/
#define DMA2_S2CR_DBM		(1 << 18)

#define DMA2_S2CR_PL_SHIFT		16
#define DMA2_S2CR_PL_MASK		0x03
/** @defgroup dma2_s2cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S2CR_PINCOS Peripheral increment offset size **/
#define DMA2_S2CR_PINCOS		(1 << 15)

#define DMA2_S2CR_MSIZE_SHIFT		13
#define DMA2_S2CR_MSIZE_MASK		0x03
/** @defgroup dma2_s2cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S2CR_PSIZE_SHIFT		11
#define DMA2_S2CR_PSIZE_MASK		0x03
/** @defgroup dma2_s2cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S2CR_MINC Memory increment mode **/
#define DMA2_S2CR_MINC		(1 << 10)
/** DMA2_S2CR_PINC Peripheral increment mode **/
#define DMA2_S2CR_PINC		(1 << 9)
/** DMA2_S2CR_CIRC Circular mode **/
#define DMA2_S2CR_CIRC		(1 << 8)

#define DMA2_S2CR_DIR_SHIFT		6
#define DMA2_S2CR_DIR_MASK		0x03
/** @defgroup dma2_s2cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S2CR_PFCTRL Peripheral flow controller **/
#define DMA2_S2CR_PFCTRL		(1 << 5)
/** DMA2_S2CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S2CR_TCIE		(1 << 4)
/** DMA2_S2CR_HTIE Half transfer interrupt enable **/
#define DMA2_S2CR_HTIE		(1 << 3)
/** DMA2_S2CR_TEIE Transfer error interrupt enable **/
#define DMA2_S2CR_TEIE		(1 << 2)
/** DMA2_S2CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S2CR_DMEIE		(1 << 1)
/** DMA2_S2CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S2CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma2_s2ndtr S2NDTR stream x number of data register
@{*/


#define DMA2_S2NDTR_NDT_SHIFT		0
#define DMA2_S2NDTR_NDT_MASK		0xffff
/** @defgroup dma2_s2ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s2par S2PAR stream x peripheral address register
@{*/


#define DMA2_S2PAR_PA_SHIFT		0
#define DMA2_S2PAR_PA_MASK		0xffffffff
/** @defgroup dma2_s2par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s2m0ar S2M0AR stream x memory 0 address register
@{*/


#define DMA2_S2M0AR_M0A_SHIFT		0
#define DMA2_S2M0AR_M0A_MASK		0xffffffff
/** @defgroup dma2_s2m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s2m1ar S2M1AR stream x memory 1 address register
@{*/


#define DMA2_S2M1AR_M1A_SHIFT		0
#define DMA2_S2M1AR_M1A_MASK		0xffffffff
/** @defgroup dma2_s2m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s2fcr S2FCR stream x FIFO control register
@{*/

/** DMA2_S2FCR_FEIE FIFO error interrupt enable **/
#define DMA2_S2FCR_FEIE		(1 << 7)

#define DMA2_S2FCR_FS_SHIFT		3
#define DMA2_S2FCR_FS_MASK		0x07
/** @defgroup dma2_s2fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA2_S2FCR_DMDIS Direct mode disable **/
#define DMA2_S2FCR_DMDIS		(1 << 2)

#define DMA2_S2FCR_FTH_SHIFT		0
#define DMA2_S2FCR_FTH_MASK		0x03
/** @defgroup dma2_s2fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s3cr S3CR stream x configuration register
@{*/


#define DMA2_S3CR_MBURST_SHIFT		23
#define DMA2_S3CR_MBURST_MASK		0x03
/** @defgroup dma2_s3cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S3CR_PBURST_SHIFT		21
#define DMA2_S3CR_PBURST_MASK		0x03
/** @defgroup dma2_s3cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA2_S3CR_ACK ACK **/
#define DMA2_S3CR_ACK		(1 << 20)
/** DMA2_S3CR_CT Current target (only in double buffer mode) **/
#define DMA2_S3CR_CT		(1 << 19)
/** DMA2_S3CR_DBM Double buffer mode **/
#define DMA2_S3CR_DBM		(1 << 18)

#define DMA2_S3CR_PL_SHIFT		16
#define DMA2_S3CR_PL_MASK		0x03
/** @defgroup dma2_s3cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S3CR_PINCOS Peripheral increment offset size **/
#define DMA2_S3CR_PINCOS		(1 << 15)

#define DMA2_S3CR_MSIZE_SHIFT		13
#define DMA2_S3CR_MSIZE_MASK		0x03
/** @defgroup dma2_s3cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S3CR_PSIZE_SHIFT		11
#define DMA2_S3CR_PSIZE_MASK		0x03
/** @defgroup dma2_s3cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S3CR_MINC Memory increment mode **/
#define DMA2_S3CR_MINC		(1 << 10)
/** DMA2_S3CR_PINC Peripheral increment mode **/
#define DMA2_S3CR_PINC		(1 << 9)
/** DMA2_S3CR_CIRC Circular mode **/
#define DMA2_S3CR_CIRC		(1 << 8)

#define DMA2_S3CR_DIR_SHIFT		6
#define DMA2_S3CR_DIR_MASK		0x03
/** @defgroup dma2_s3cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S3CR_PFCTRL Peripheral flow controller **/
#define DMA2_S3CR_PFCTRL		(1 << 5)
/** DMA2_S3CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S3CR_TCIE		(1 << 4)
/** DMA2_S3CR_HTIE Half transfer interrupt enable **/
#define DMA2_S3CR_HTIE		(1 << 3)
/** DMA2_S3CR_TEIE Transfer error interrupt enable **/
#define DMA2_S3CR_TEIE		(1 << 2)
/** DMA2_S3CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S3CR_DMEIE		(1 << 1)
/** DMA2_S3CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S3CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma2_s3ndtr S3NDTR stream x number of data register
@{*/


#define DMA2_S3NDTR_NDT_SHIFT		0
#define DMA2_S3NDTR_NDT_MASK		0xffff
/** @defgroup dma2_s3ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s3par S3PAR stream x peripheral address register
@{*/


#define DMA2_S3PAR_PA_SHIFT		0
#define DMA2_S3PAR_PA_MASK		0xffffffff
/** @defgroup dma2_s3par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s3m0ar S3M0AR stream x memory 0 address register
@{*/


#define DMA2_S3M0AR_M0A_SHIFT		0
#define DMA2_S3M0AR_M0A_MASK		0xffffffff
/** @defgroup dma2_s3m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s3m1ar S3M1AR stream x memory 1 address register
@{*/


#define DMA2_S3M1AR_M1A_SHIFT		0
#define DMA2_S3M1AR_M1A_MASK		0xffffffff
/** @defgroup dma2_s3m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s3fcr S3FCR stream x FIFO control register
@{*/

/** DMA2_S3FCR_FEIE FIFO error interrupt enable **/
#define DMA2_S3FCR_FEIE		(1 << 7)

